Autodesk.Revit.DB.GradientBackgroundSettings.GroundColor
The color of the ground.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.GradientBackgroundSettings.HorizonColor
The color of the horizon.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.GradientBackgroundSettings.SkyColor
The color of the top of the sky.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.GradientBackgroundSettings
Represents the view gradient background settings.
Remarks:
The colors of the background are interpolated for the pixels
corresponding to the sky - from the "sky color" (top) to the "horizon
color" (bottom).  The ground is represented with a solid color ("ground color").
Since:
2014